Repository: simone-di-paolo/imaginarium-storyteller
Catalog: lib/l10n/app_*.arb
Languages: it

# createYourStory
source: Customize Your Story
it: Personalizza la tua storia

# makeItPersonal
source: Make it personal for your little one
it: Rendila personale per il tuo piccolo

source: Character Details
it: Dettagli del personaggio

source: Child's Name
it: Nome del bambino

# enterChildsName
source: Enter your child's name
it: Inserisci il nome del tuo bambino

source: Age
it: Età

source: How old are they?
it: Quanti anni ha?

source: Favorite Animal
it: Animale preferito

source: What's their favorite animal?
it: Qual è il suo animale preferito?

source: Story Setting
it: Ambientazione della storia

source: Where should the story take place?
it: Dove dovrebbe svolgersi la storia?

# magicalForest
source: e.g., magical forest, space station...
it: es. foresta incantata, stazione spaziale...

# reviewAndGenerate
source: Review & Generate
it: Rivedi e genera

source: Story Preview
it: Anteprima della storia

source: Category:
it: Categoria:

source: Main Character:
it: Protagonista:

source: Companion:
it: Compagno:

source: Setting:
it: Ambientazione:

source: AI Magic Ready!
it: Magia AI pronta!

# weWillCreateAUniqueStory
source: We'll create a unique story with beautiful backgrounds just for you.
it: Creeremo una storia unica con sfondi meravigliosi solo per te.

source: Create New Story
it: Crea una nuova storia

# chooseACategory
source: Choose a Story Category
it: Scegli una categoria di storia

# whatKindOfAdventure
source: What kind of adventure should we create?
it: Che tipo di avventura dovremmo creare?

# continueButton
source: Continue
it: Continua

# generateStoryButton
source: Generate Story
it: Genera storia

# pleaseSelectCategory
source: Please select a category first.
it: Seleziona prima una categoria.

# storyInclude
source: Here's what your story will include
it: Ecco cosa includerà la tua storia
